Step 1: Configure SSH login on router

Execute command on all routers
R#
 ip domain-name ccnasecurity.com
 username admin secret adminpa55
 line vty 0 4
 login local
 crypto key generate rsa
How many bits in the modulus [512]: 1024


Step 4: Configure loop back address on Router 2

R2#
 int loopback 0
 ip address 192.168.2.1 255.255.255.0
 no shut

Step 5: Configure static routing on routers
Execute command on all routers
R1#
ip route 192.168.3.0 255.255.255.0 10.1.1.2
ip route 10.2.2.0 255.255.255.252 10.1.1.2
ip route 192.168.2.0 255.255.255.0 10.1.1.2

R2#
ip route 192.168.1.0 255.255.255.0 10.1.1.1
ip route 192.168.3.0 255.255.255.0 10.2.2.1


R3#
ip route 192.168.1.0 255.255.255.0 10.2.2.2
ip route 192.168.2.0 255.255.255.0 10.2.2.2
ip route 10.1.1.0 255.255.255.0 10.2.2.2

R3#
ip route 192.168.1.0 255.255.255.0 10.2.2.2
ip route 192.168.2.0 255.255.255.0 10.2.2.2
ip route 10.1.1.0 255.255.255.0 10.2.2.2

Part 2: Verify Basic Network Connectivity
Step 1: From PC-A, verify connectivity to PC-C and R2.
PCA> ping 192.168.3.3
(Successful)
PCA> ping 192.168.2.1
(Successful)
PCA> ssh –l admin 192.168.2.1
Password: adminpa55
R2>exit


Step 2: From PC-C, verify connectivity to PC-A and R2.
PCC> ping 192.168.1.3
(Successful)
PCC> ping 192.168.2.1
(Successful)
PCC> ssh –l admin 192.168.2.1
Password: adminpa55
R2>exit
Open a web browser to the PC-A server (192.168.1.3) to display the web page.
Close the browser when done.
Desktop->Web Browser->192.168.1.3
(Successful)


Part 3: Secure Access to Routers
Step 1: Configure ACL 10 to block all remote access to the routers except from PC-C
Execute command on all routers
R#
 access-list 10 permit host 192.168.3.3


Step 2: Apply ACL 10 to ingress traffic on the VTY lines.
Execute command on all routers
R#
 line vty 0 4
 access-class 10 in


Step 3: Verify exclusive access from management station PC-C.
PCC> ssh –l admin 192.168.2.1
Password: adminpa55
R2>exit
Step 4: Verify denial from PC-A.
PCA> ssh –l admin 192.168.2.1
Connection refused by remote host


Part 4: Create a Numbered IP ACL 120 on R1
Step 1: Verify that PC-C can access the PC-A via HTTPS using the web browser.
Be sure to disable HTTP and enable HTTPS on server PC-A in Services tab.


Step 2: Configure ACL 120 to specifically permit and deny the specified traffic.
R1#
 access-list 120 permit udp any host 192.168.1.3 eq domain
 access-list 120 permit tcp any host 192.168.1.3 eq smtp
 access-list 120 permit tcp any host 192.168.1.3 eq ftp
 access-list 120 deny tcp any host 192.168.1.3 eq 443
 access-list 120 permit tcp host 192.168.3.3 host 10.1.1.1 eq 22


Step 3: Apply the ACL to interface
R1#
 int se0/1/0
 ip access-group 120 in

Step 4: Verify that PC-C cannot access PC-A via HTTPS using the web browser.
Desktop->Web Browser->192.168.1.3
(Unsuccessful) Request timed out


Part 5: Modify an Existing ACL on R1
Step 1: Verify that PC-A cannot successfully ping the loopback interface on R2.
PCA> ping 192.168.2.1
(Unsuccessful) Request timed out


Step 2: Make any necessary changes to ACL 120 to permit and deny the specified traffic.
R1#
 access-list 120 permit icmp any any echo-reply
 access-list 120 permit icmp any any unreachable
 access-list 120 deny icmp any any
 access-list 120 permit ip any any

Step 3: Verify that PC-A can successfully ping the loopback interface on R2.
PCA> ping 192.168.2.1 (Successful)


Part 6: Create a Numbered IP ACL 110 on R3
Step 1: Configure ACL 110 to permit only traffic from the inside network.
R3#
 access-list 110 permit ip 192.168.3.0 0.0.0.255 any

Step 2: Apply the ACL to interface
R3#
 int gig0/1
 ip access-group 110 in

Part 7: Create a Numbered IP ACL 100 on R3
Step 1: Configure ACL 100 to block all specified traffic from the outside network.
R3#
 access-list 100 permit tcp 10.0.0.0 0.255.255.255 host 192.168.3.3 eq 22
 access-list 100 deny ip 10.0.0.0 0.255.255.255 any
 access-list 100 deny ip 172.16.0.0 0.15.255.255 any
 access-list 100 deny ip 192.168.0.0 0.0.255.255 any
 access-list 100 deny ip 127.0.0.0 0.255.255.255 any
 access-list 100 deny ip 224.0.0.0 15.255.255.255 any
 access-list 100 permit ip any any


Step 2: Apply the ACL to interface
R3#
 interface se0/1/0
 ip access-group 100 in

Step 3: Confirm that the specified traffic entering interface Serial is handled correctly.
PCC> ping 192.168.1.3
(Unsuccessful)
PCC> ssh –l admin 192.168.2.1
Password: adminpa55
R2>exit





